In [2]:
import pandas
pandas.__version__

'1.0.5'

In [3]:
import numpy as np 
import pandas as pd

In [5]:
counts = pd.Series([234,323,235,873])
print(counts)

0    234
1    323
2    235
3    873
dtype: int64

In [7]:
counts.values

array([234, 323, 235, 873], dtype=int64)

In [8]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
players = pd.Series([657,453,986],index = ["sujith","VK","mahi"])
players

sujith    657
VK        453
mahi      986
dtype: int64

In [17]:
players["mahi"]

986

In [16]:
players[2]

986

In [21]:
players.name= "scores"
players.index.name="Star names"
players

Star names
sujith    657
VK        453
mahi      986
Name: scores, dtype: int64

In [22]:
np.log(players)

Star names
sujith    6.487684
VK        6.115892
mahi      6.893656
Name: scores, dtype: float64

In [24]:
players[players>500]

Star names
sujith    657
mahi      986
Name: scores, dtype: int64

In [30]:
players_dict= {'sujith':786,'mahi':987,'vk':675}
print(players_dict)
pd.Series(players_dict)

{'sujith': 786, 'mahi': 987, 'vk': 675}

sujith    786
mahi      987
vk        675
dtype: int64

In [37]:
data={"Name":["sujith","mahi","vk"],"Runs":[767,899,654],"Matches":[13,16,18]}
print(data)
pd.DataFrame(data)

{'Name': ['sujith', 'mahi', 'vk'], 'Runs': [767, 899, 654], 'Matches': [13, 16, 18]}

     Name  Runs  Matches
0  sujith   767       13
1    mahi   899       16
2      vk   654       18

In [38]:
df = pd.DataFrame(data, columns=["Name","Matches","Runs"])
df

     Name  Matches  Runs
0  sujith       13   767
1    mahi       16   899
2      vk       18   654

In [43]:
df["Average"]= df.Runs / df.Matches
df

     Name  Matches  Runs    Average
0  sujith       13   767  59.000000
1    mahi       16   899  56.187500
2      vk       18   654  36.333333

In [53]:
df["Serie_aligned"]= pd.Series(range(3),index = [0,1,2])
df

     Name  Matches  Runs    Average  Serie_aligned
0  sujith       13   767  59.000000              0
1    mahi       16   899  56.187500              1
2      vk       18   654  36.333333              2

In [54]:
df.to_dict()

{'Name': {0: 'sujith', 1: 'mahi', 2: 'vk'},
 'Matches': {0: 13, 1: 16, 2: 18},
 'Runs': {0: 767, 1: 899, 2: 654},
 'Average': {0: 59.0, 1: 56.1875, 2: 36.333333333333336},
 'Serie_aligned': {0: 0, 1: 1, 2: 2}}

In [59]:
pd.DataFrame(df.to_dict())

     Name  Matches  Runs    Average  Serie_aligned
0  sujith       13   767  59.000000              0
1    mahi       16   899  56.187500              1
2      vk       18   654  36.333333              2

In [61]:
data=[{"a":i,"b":5*i}for i in range(6)]
print(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 5}, {'a': 2, 'b': 10}, {'a': 3, 'b': 15}, {'a': 4, 'b': 20}, {'a': 5, 'b': 25}]

In [62]:
pd.DataFrame(data)

   a   b
0  0   0
1  1   5
2  2  10
3  3  15
4  4  20
5  5  25